/*
 |--------------------------------------------------------------------------
 | リファクタリング前
 |--------------------------------------------------------------------------
 */
function deliveryDate (anOrder, isRush) {
  if (isRush) {
    // お急ぎ便の処理
  } else {
    // 通常便の処理
  }
}

// 呼び出し元
aShipment.deliveryDate(anOrder, true)
aShipment.deliveryDate(anOrder, false)
/*
 |--------------------------------------------------------------------------
 | リファクタリング後
 |--------------------------------------------------------------------------
 */

// お急ぎ便の処理を関数に切り出す
function rushDeliveryDate (anOrder) {
  // お急ぎ便の処理
}

// 通常便の処理を関数に切り出す
function regularDeliveryDate (anOrder) {
  // 通常便の処理
}
